# RuledSurface Properties

---
The RuledSurface type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from Surface)
| OrientationMatchesParametricOrientation|  Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. (Inherited from Surface)
Top
#### Reference
RuledSurface Class
Autodesk.Revit.DB Namespace